_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УчетВыполненныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УчетВыполненныхРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_УчетВыполненныхРабот</xr:Item>
				<xr:Item>AccumulationRegister.УСОERP_УчетПриемаРеализацииРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыОперацийУчетаВыполненныхРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаДлительности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполненияНаНачалоПериода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемНаНачалоПериода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_ВыполнениеРаботСубподрядчиком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_ВыполнениеРаботСубподрядчиком</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКС2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКС2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКС3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКС3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтатусыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыПланов</Name>
			<Comment>Статусы планов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыСценариевПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыСценариевПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийРабочий</Name>
					<Comment>Внешний рабочий (для договора с заказчиком)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыОперацийУчетаВыполненныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыОперацийУчетаВыполненныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеСобственнымиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеСиламиСубподрядчика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыПланированияСтроительныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыПланированияСтроительныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месячный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедельноСуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ЕдиницыДлительности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ЕдиницыДлительности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ЕдиницыИзмеренияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмеренияВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Секунда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сутки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УчетВыполненныхРабот/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	ЭтаФорма.ТолькоПросмотр = (Объект.Статус = Перечисления.СтатусыПланов.Утвержден И Объект.Проведен);
	Элементы.РаботыГруппаЗаполнить.Видимость = НЕ ЭтаФорма.ТолькоПросмотр;
	
	НовыйВариант = Объект.ДокументУтверждения.СценарийПланирования.НовыйВариант;
	
	УСОERP_ОбработкаТабличныхЧастей.СортироватьТаблицу(Объект.Работы);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);


КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТекущаяСтрока	=	Элементы.Работы.ТекущаяСтрока;
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение, ТекущаяСтрока);
	
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма);
	// Обработчик подсистемы "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма);
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


#Область ИзменениеРеквизитовШапкиНаКлиенте

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииОрганизацииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ПриИзмененииПроектаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Работы.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОчиститьТабличнуюЧасть(ВыбранноеЗначение, Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	ПартнерПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Работы.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОчиститьТабличнуюЧасть(ВыбранноеЗначение, Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПериодаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)  	
	
	Если ВыбранноеЗначение > Объект.ДатаОкончанияПериода Тогда
		ВыбранноеЗначение = Объект.ДатаОкончанияПериода;
		Объект.ДатаНачалаПериода = ВыбранноеЗначение;
	КонецЕсли;
	
	Если Объект.Работы.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОчиститьТабличнуюЧасть(ВыбранноеЗначение, Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПериодаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение < Объект.ДатаНачалаПериода Тогда
		ВыбранноеЗначение = Объект.ДатаНачалаПериода;
		Объект.ДатаОкончанияПериода = ВыбранноеЗначение;
	КонецЕсли;
	
	
	Если Объект.Работы.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОчиститьТабличнуюЧасть(ВыбранноеЗначение, Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличнуюЧасть(ВыбранноеЗначение, ИмяЭлемента)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Значение", ВыбранноеЗначение);
	ДопПараметры.Вставить("Имя", ИмяЭлемента);
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВопроса", ЭтаФорма, ДопПараметры);
	ПоказатьВопрос(Оповещение, "Табличная часть ""Работы"" будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВопроса(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		Объект.Работы.Очистить();
		Если ТипЗнч(ДопПараметры.Значение) = Тип("СправочникСсылка.СМ_ОбъектыСтроительства") Тогда
			Объект.ОбъектСтроительства = ДопПараметры.Значение;
		ИначеЕсли ТипЗнч(ДопПараметры.Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
			Объект.Контрагент = ДопПараметры.Значение;
		ИначеЕсли ТипЗнч(ДопПараметры.Значение) = Тип("Дата") Тогда
			Если ДопПараметры.Имя = "ДатаНачалаПериода" Тогда
				Объект.ДатаНачалаПериода = ДопПараметры.Значение;
			Иначе
				Объект.ДатаОкончанияПериода = ДопПараметры.Значение;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДопПараметры.Значение) = Тип("Структура") Тогда
			Объект.ДатаНачалаПериода = ДопПараметры.Значение.НачалоПериода;
			Объект.ДатаОкончанияПериода = ДопПараметры.Значение.КонецПериода;
		ИначеЕсли ТипЗнч(ДопПараметры.Значение) = Тип("ПеречислениеСсылка.УСОERP_ВидыОперацийУчетаВыполненныхРабот") Тогда
			Объект.ВидОперации	=	ДопПараметры.Значение;
			ПриИзмененииВидаОперацииСервер();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Работы.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОчиститьТабличнуюЧасть(ВыбранноеЗначение, Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ПриИзмененииВидаОперацииСервер();
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеРеквизитовТЧнаКлиенте
 
&НаКлиенте
Процедура РаботыРаботаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Работы.ТекущаяСтрока;
	РаботыРаботаПриИзмененииНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыРаботаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	=	Ложь;
		
	//СписокРабот = Новый СписокЗначений;
	//ПодборРаботНаСервере(СписокРабот);
	//
	//Форма = ПолучитьФорму("Справочник.УСОERP_СтроительныеРаботы.ФормаВыбора", Новый Структура("ОбъектСтроительства, СписокРабот", Объект.ОбъектСтроительства, СписокРабот), ЭтаФорма);	
	Форма = ПолучитьФорму("Справочник.УСОERP_СтроительныеРаботы.ФормаВыбора", Новый Структура("Организация, ОбъектСтроительства, Утверждена", Объект.Организация, Объект.ОбъектСтроительства, Истина), ЭтаФорма);	
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВладельцев(ОбъектСтроительства)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_СценарииПланированияПроектовСтроительства.Ссылка КАК Владелец
	|ИЗ
	|	Справочник.УСОERP_СценарииПланированияПроектовСтроительства КАК УСОERP_СценарииПланированияПроектовСтроительства
	|ГДЕ
	|	УСОERP_СценарииПланированияПроектовСтроительства.Владелец = &ОбъектСтроительства
	|	И УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыСценариевПланирования.Рабочий)
	|	И УСОERP_СценарииПланированияПроектовСтроительства.ПометкаУдаления = ЛОЖЬ
	|	И УСОERP_СценарииПланированияПроектовСтроительства.Организация = &Организация";
	Запрос.УстановитьПараметр("ОбъектСтроительства", ОбъектСтроительства);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Владелец");
	
КонецФункции

&НаКлиенте
Процедура РаботыПроцентВыполненияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Работы.ТекущаяСтрока;
	РаботыПроцентВыполненияПриИзмененииНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыОбъемПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Работы.ТекущаяСтрока;
	РаботыОбъемПриИзмененииНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьДлительностьНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьДлительностьНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыДлительностьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьДатуОкончанияНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//СтандартныеПодсистемы.Свойства 
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()

	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	СтруктураОтбора = Новый Структура;
	ЗаполнитьСтруктуруОтбораНаСервере(СтруктураОтбора);

	ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаПодбора",СтруктураОтбора,ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруОтбораНаСервере(СтруктураОтбора) 	
		
	Если НовыйВариант Тогда
		
		СтруктураОтбора.Вставить("ДокументУтверждения",Объект.ДокументУтверждения);
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора.Вставить("Организация",Объект.Организация);
	СтруктураОтбора.Вставить("ОбъектСтроительства",Объект.ОбъектСтроительства);
	СтруктураОтбора.Вставить("ПометкаУдаления",Ложь);
	СтруктураОтбора.Вставить("Утверждена",Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	// отметка незаполненного реквизитов шапки в зависимости от вида операции
	// вид операции = выполнение собственными силами
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Подразделение.Имя);

	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.ВидОперации");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение	=	Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСобственнымиСилами;
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.Подразделение");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Подразделение.Имя);

	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.ВидОперации");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение	=	Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСобственнымиСилами;
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.Подразделение");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	// вид операции = выполнение силами субподрядчика
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Партнер.Имя);
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		= 	Новый ПолеКомпоновкиДанных("Объект.ВидОперации");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение	=	Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСиламиСубподрядчика;
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.Партнер");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Контрагент.Имя);
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		= 	Новый ПолеКомпоновкиДанных("Объект.ВидОперации");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение	=	Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСиламиСубподрядчика;
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.Контрагент");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Партнер.Имя);
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		= 	Новый ПолеКомпоновкиДанных("Объект.ВидОперации");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение	=	Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСиламиСубподрядчика;
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.Партнер");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Контрагент.Имя);
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		= 	Новый ПолеКомпоновкиДанных("Объект.ВидОперации");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение	=	Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСиламиСубподрядчика;
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.Контрагент");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	// превышение планового объема выполнения
	Элемент = УсловноеОформление.Элементы.Добавить();

	ИмяТЧ	=	Метаданные.Документы.УСОERP_УчетВыполненныхРабот.ТабличныеЧасти.Работы;
	Для Каждого РеквизитТЧ Из ИмяТЧ.Реквизиты Цикл
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[Строка(ИмяТЧ) + РеквизитТЧ.Имя].Имя);
	КонецЦикла;
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[Строка(ИмяТЧ) + "КодСДР"].Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.ОбъемВсего");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.ОбъемВыполнено");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
	// редактирование объема и процента выполнения только у работы
	Элемент				=	УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента		=	Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле	=	Новый ПолеКомпоновкиДанных(Элементы[Строка(ИмяТЧ) + "Объем"].Имя);
	
	ПолеЭлемента		=	Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле	=	Новый ПолеКомпоновкиДанных(Элементы[Строка(ИмяТЧ) + "ПроцентВыполнения"].Имя);
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.Работы.ЭтоСуммарнаяРабота");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение	=	Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// отметка незаполненного реквизитов "Объем" и "ПроцентВыполнения" только у работы
	Элемент				=	УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента		=	Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле	=	Новый ПолеКомпоновкиДанных(Элементы[Строка(ИмяТЧ) + "Объем"].Имя);
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.Работы.ЭтоСуммарнаяРабота");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение	=	Ложь;
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.Работы.Объем");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	//
	Элемент				=	УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента		=	Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле	=	Новый ПолеКомпоновкиДанных(Элементы[Строка(ИмяТЧ) + "ПроцентВыполнения"].Имя);
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.Работы.ЭтоСуммарнаяРабота");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение	=	Ложь;
	
	ОтборЭлемента					=	Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Объект.Работы.ПроцентВыполнения");
	ОтборЭлемента.ВидСравнения		=	ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

КонецПроцедуры

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение, ИдентификаторСтроки = Неопределено)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда 
		
		Для Каждого Элем из ВыбранноеЗначение Цикл
			ЗаполнитьТЧВыбраннымиРаботами(Элем, ИдентификаторСтроки);
		КонецЦикла;
		
		Если НовыйВариант Тогда			
			Объект.Работы.Сортировать("ПорядокСортировки");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.УСОERP_СтроительныеРаботы") Тогда
		
		ЗаполнитьТЧВыбраннымиРаботами(ВыбранноеЗначение, ИдентификаторСтроки);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выбор этапа в данном случае не предусмотрен! Необходимо выбрать конкретную работу.'")
		                                                 + Символы.ПС + ОписаниеОшибки());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧВыбраннымиРаботами(ВыбранноеЗначение, ИдентификаторСтроки = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;  	
	
	ЭтоСуммарнаяРабота = УСОERP_УправлениеСтроительнымПроизводством.ЭтоСуммарнаяРабота(ВыбранноеЗначение);
	
	Если Не ЭтоСуммарнаяРабота Тогда
		
		СтрокиРабот = Объект.Работы.НайтиСтроки(Новый Структура("Работа", ВыбранноеЗначение));
		
		Если СтрокиРабот.Количество() = 0 Тогда 
			
			ТекущаяСтрока	=	Объект.Работы.Добавить();
			ТекущаяСтрока.Работа = ВыбранноеЗначение;
			РаботыРаботаПриИзмененииНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());
			
		КонецЕсли;
		
	Иначе
		
		//Если ИдентификаторСтроки = Неопределено Тогда
		// добавление этапа
		Если НовыйВариант Тогда
			
			ПодчиненныеРаботы = ПолучитьПодчиненныеРаботы(ВыбранноеЗначение);				
			
			//Иначе
			//	
			//ТекущаяСтрока = Объект.Работы.Добавить();
			//ТекущаяСтрока.Работа = ВыбранноеЗначение;
			//РаботыРаботаПриИзмененииНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());
			//// добавление подчиненных работ
			//ПодчиненныеРаботы = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПодчиненныеРаботы(ВыбранноеЗначение, Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный, Дата("00010101"));
			
			//КонецЕсли;
			
			Для каждого ЭлПодчиненныеРаботы Из ПодчиненныеРаботы Цикл
				
				СтрокиРабот = Объект.Работы.НайтиСтроки(Новый Структура("Работа", ЭлПодчиненныеРаботы.Работа));
				
				Если СтрокиРабот.Количество() = 0 Тогда 
					
					ТекущаяСтрока = Объект.Работы.Добавить();
					ТекущаяСтрока.Работа = ЭлПодчиненныеРаботы.Работа;
					РаботыРаботаПриИзмененииНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());
					
				КонецЕсли;
				
			КонецЦикла;
			
			Объект.Работы.Сортировать("ПорядокСортировки");
			
		Иначе	
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выбор этапа в данном случае не предусмотрен! Необходимо выбрать конкретную работу.'")
			+ Символы.ПС + ОписаниеОшибки());
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция   ПолучитьПодчиненныеРаботы(ВыбранноеЗначение)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Работа",ВыбранноеЗначение);
	Запрос.УстановитьПараметр("МассивРабот",Объект.Работы.Выгрузить().ВыгрузитьКолонку("Работа"));
	Запрос.УстановитьПараметр("Владелец",Объект.ДокументУтверждения.КопияСценария);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_СтроительныеРаботы.Ссылка КАК Работа
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|ГДЕ
	|	УСОERP_СтроительныеРаботы.Родитель В ИЕРАРХИИ(&Работа)
	|	И НЕ УСОERP_СтроительныеРаботы.СуммарнаяРабота
	|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
	|	И НЕ УСОERP_СтроительныеРаботы.Ссылка В (&МассивРабот)
	|	И УСОERP_СтроительныеРаботы.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	УСОERP_СтроительныеРаботы.ПорядокСортировки";	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции  	

#КонецОбласти

#Область ПриИзмененииРеквизитовШапкиНаСервере

&НаСервере
Процедура ПриИзмененииВидаОперацииСервер()
	
	УстановитьВидимостьЭлементовПоВидуОперацииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОрганизацииСервер()
	
	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Организация");
	
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПроектаСервер()
	
	УстановитьВидимостьКомандТЧ();
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер()
	
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	
КонецПроцедуры	

#КонецОбласти

#Область ПриИзмененииРеквизитовТЧнаСервере

&НаСервере
Процедура РаботыРаботаПриИзмененииНаСервере(ИдентификаторСтроки)
	
	ТекущаяСтрока = Объект.Работы.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СписокРабот	=	Новый СписокЗначений;
	
	Если НовыйВариант Тогда
		
		СписокРабот.Добавить(ТекущаяСтрока.Работа.РаботаИсточник);
		
	Иначе
		
		СписокРабот.Добавить(ТекущаяСтрока.Работа);
		
	КонецЕсли; 	
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", Объект.Организация);
	СтруктураПараметров.Вставить("ДатаСреза",	Объект.Дата);
	СтруктураПараметров.Вставить("ДатаНачала", Объект.ДатаНачалаПериода);
	СтруктураПараметров.Вставить("ДатаОкончания", Объект.ДатаОкончанияПериода);
	СтруктураПараметров.Вставить("Работа", СписокРабот);
	СтруктураПараметров.Вставить("ОбъектСтроительства", Объект.ОбъектСтроительства);
	СтруктураПараметров.Вставить("ДокументСсылка",Объект.Ссылка);
	
	Если Объект.ВидОперации	=	Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСобственнымиСилами Тогда
		
		СтруктураПараметров.Вставить("Подразделение", Объект.Подразделение);
		СтруктураПараметров.Вставить("ВидПланирования", Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.НедельноСуточный);
		
		ДанныеПоРаботам = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьДанныеПоВыполнениюРабот(СтруктураПараметров);
		
		Если ДанныеПоРаботам.Количество() = 0 Тогда
			
			СтруктураПараметров.Вставить("ВидПланирования", Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Месячный);
			ДанныеПоРаботам = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьДанныеПоВыполнениюРабот(СтруктураПараметров);
			
		КонецЕсли;
		
		Если ДанныеПоРаботам.Количество() = 0 Тогда
			
			СтруктураПараметров.Вставить("ВидПланирования", Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный);
			ДанныеПоРаботам = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьДанныеПоВыполнениюРабот(СтруктураПараметров);
			
		КонецЕсли;
		
	Иначе
		
		СтруктураПараметров.Вставить("ИмяРегистра", ?(Не Объект.ОбъектСтроительства.ИспользоватьНедельноСуточныеПланы, "РегистрНакопления.УСОERP_ВыполнениеРаботСубподрядчиком", ""));
		СтруктураПараметров.Вставить("Партнер", Объект.Партнер);
		СтруктураПараметров.Вставить("Контрагент", Объект.Контрагент);
		
		ДанныеПоРаботам = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьДанныеПоВыполнениюРабот(СтруктураПараметров);
		
	КонецЕсли;
	
	СтруктураПараметров.ДатаОкончания = Дата(3999,1,1);
	
	ДанныеПоРаботамВсего = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьДанныеПоВыполнениюРабот(СтруктураПараметров);
	
	Если НовыйВариант Тогда
		
		ТекущаяСтрока.ОбъемВсего = ТекущаяСтрока.Работа.ОбъемРаботы;
		ТекущаяСтрока.ЕдиницаОбъема = ТекущаяСтрока.Работа.ЕдиницаОбъема;
		ТекущаяСтрока.Длительность = ТекущаяСтрока.Работа.Длительность;
		ТекущаяСтрока.ЕдиницаДлительности = ТекущаяСтрока.Работа.ЕдиницаДлительности;
		ТекущаяСтрока.ДатаНачала = ТекущаяСтрока.Работа.ДатаНачала;
		ТекущаяСтрока.ДатаОкончания = ТекущаяСтрока.Работа.ДатаОкончания;
		ТекущаяСтрока.ПроцентВыполненияНаНачалоПериода	= 0;
		ТекущаяСтрока.ОбъемНаНачалоПериода 				= 0;
		ТекущаяСтрока.ПорядокСортировки = ТекущаяСтрока.Работа.ПорядокСортировки;
		
		Если ДанныеПоРаботам.Количество() Тогда
			
			ТекущаяСтрока.ПроцентВыполненияНаНачалоПериода = ДанныеПоРаботам.Получить(0).ПроцентВыполненияНаНачалоПериода;
			ТекущаяСтрока.ОбъемНаНачалоПериода 			   = ДанныеПоРаботам.Получить(0).ОбъемНаНачалоПериода;			
			
		КонецЕсли;
		
		СтрокаРаботыВсего = ДанныеПоРаботамВсего.Найти(ТекущаяСтрока.Работа.РаботаИсточник);
		
		Если СтрокаРаботыВсего.ПроцентВыполненияНаНачалоПериода >= 100 Тогда
			
			ПутьКДанным = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Работы", ТекущаяСтрока.НомерСтроки, "ПроцентВыполненияНаНачалоПериода");

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У работы "+СтрокаРаботыВсего.Работа.КодСДР+" "+СтрокаРаботыВсего.Работа+" процент выполнения больше 100",,,ПутьКДанным);
			
		КонецЕсли;  		
		
	Иначе  		
		
		Если ДанныеПоРаботам.Количество() > 0 Тогда
			
			Для каждого ЭлРабота Из ДанныеПоРаботам Цикл
				
				ТекущаяСтрока.ОбъемВсего 						= ЭлРабота.ОбъемВсего;
				ТекущаяСтрока.ЕдиницаОбъема 					= ЭлРабота.ЕдиницаОбъема;
				ТекущаяСтрока.Длительность 						= ЭлРабота.Длительность;
				ТекущаяСтрока.ЕдиницаДлительности 				= ЭлРабота.ЕдиницаДлительности;
				ТекущаяСтрока.ПроцентВыполненияНаНачалоПериода	= ЭлРабота.ПроцентВыполненияНаНачалоПериода;
				ТекущаяСтрока.ОбъемНаНачалоПериода 				= ЭлРабота.ОбъемНаНачалоПериода;
				ТекущаяСтрока.ДатаНачала 						= ЭлРабота.ДатаНачала;
				ТекущаяСтрока.ДатаОкончания 					= ЭлРабота.ДатаОкончания;
				
			КонецЦикла;
			
		Иначе
			
			ТекущаяСтрока.ОбъемВсего 						= 0;
			ТекущаяСтрока.ЕдиницаОбъема 					= Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
			ТекущаяСтрока.Длительность 						= 0;
			ТекущаяСтрока.ЕдиницаДлительности 				= Перечисления.УСОERP_ЕдиницыДлительности.ПустаяСсылка();
			ТекущаяСтрока.ПроцентВыполненияНаНачалоПериода	= 0;
			ТекущаяСтрока.ОбъемНаНачалоПериода 				= 0;
			ТекущаяСтрока.ДатаНачала 						= Дата("00010101");
			ТекущаяСтрока.ДатаОкончания 					= Дата("00010101");
			
		КонецЕсли;
		
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма, ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура РаботыПроцентВыполненияПриИзмененииНаСервере(ИдентификаторСтроки)
	
	ТекущаяСтрока = Объект.Работы.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущаяСтрока.Объем = ТекущаяСтрока.ОбъемВсего * ТекущаяСтрока.ПроцентВыполнения / 100;
	
	РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма, ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура РаботыОбъемПриИзмененииНаСервере(ИдентификаторСтроки)
	
	ТекущаяСтрока = Объект.Работы.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущаяСтрока.ПроцентВыполнения = ТекущаяСтрока.Объем * 100 / ТекущаяСтрока.ОбъемВсего;
	
	РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма, ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандТЧ

&НаСервере
Процедура ЗаполнитьНаСервере(ВидПланирования, СписокРабот = Неопределено, ПолучитьСписок = Ложь)
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_УчетВыполненныхРабот_ЗаполнитьНаСервере(ЭтотОбъект, ВидПланирования, СписокРабот, ПолучитьСписок);
	
	Если НЕ НовыйВариант Тогда
	УСОERP_ОбработкаТабличныхЧастей.СортироватьТаблицу(Объект.Работы);
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзПланаГрафика(Команда)
	
	ВидПланирования = ПредопределенноеЗначение("Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Календарный");
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено подразделение.", Объект.Ссылка, "Подразделение", "Объект");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере(ВидПланирования); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзМесячныхПланов(Команда)
	
	ВидПланирования = ПредопределенноеЗначение("Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Месячный");
	ЗаполнитьНаСервере(ВидПланирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзНедельноСуточныхПланов(Команда)
	
	ВидПланирования = ПредопределенноеЗначение("Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.НедельноСуточный");
	ЗаполнитьНаСервере(ВидПланирования);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСубподрядчикуНаСервере(СписокРабот = Неопределено, ПолучитьСписок = Ложь)
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_УчетВыполненныхРабот_ЗаполнитьПоСубподрядчикуНаСервере(ЭтотОбъект, СписокРабот, ПолучитьСписок);
	
	Если НЕ НовыйВариант Тогда
		УСОERP_ОбработкаТабличныхЧастей.СортироватьТаблицу(Объект.Работы);
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоВыполнениюОтСубподрядчика(Команда)
	
	ЗаполнитьПоСубподрядчикуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УстановитьВидимостьЭлементовПоВидуОперацииСервер();
	
	РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма);
	
	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоВидуОперацииСервер()
	
	Перем МассивВсехРеквизитов;
	Перем МассивРеквизитовОперации;
	
	Документы.УСОERP_УчетВыполненныхРабот.ЗаполнитьИменаРеквизитовПоОперации(
		Объект.ВидОперации,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
		
	ДенежныеСредстваСервер.УстановитьВидимостьЭлементовПоМассиву(
		Элементы,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
		
	УстановитьВидимостьКомандТЧ();
	ОчиститьРеквизитыШапки();
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКомандТЧ()

	Элементы.ЗаполнитьИзПГ.Видимость						=	Объект.ВидОперации	=	Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСобственнымиСилами;
	//Элементы.ЗаполнитьИзМесячныхПланов.Видимость			=	(Объект.ВидОперации	= Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСобственнымиСилами
	//															И Объект.ОбъектСтроительства.ИспользоватьМесячныеПланы);
	//Элементы.ЗаполнитьИзНедельноСуточныхПланов.Видимость	=	(Объект.ВидОперации = Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСобственнымиСилами
																//И Объект.ОбъектСтроительства.ИспользоватьНедельноСуточныеПланы);
	Элементы.ЗаполнитьПоВыполнениюОтСубподрядчика.Видимость	=	Объект.ВидОперации = Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСиламиСубподрядчика;
	//Элементы.ЗаполнитьПоПлануСубподрядныхРабот.Видимость	=	(Объект.ВидОперации = Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСиламиСубподрядчика
	//															И Объект.ОбъектСтроительства.ИспользоватьНедельноСуточныеПланы);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРеквизитыШапки()

	Если Объект.ВидОперации = Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСобственнымиСилами Тогда
		Объект.Партнер			=	Справочники.Партнеры.ПустаяСсылка();
		Объект.Контрагент		=	Справочники.Контрагенты.ПустаяСсылка();
	Иначе
		Объект.Подразделение	=	Справочники.СтруктураПредприятия.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	//ОбщегоНазначенияУТКлиент.РедактироватьПериод(Объект, 
	//	Новый Структура("ДатаНачала, ДатаОкончания", "ДатаНачала", "ДатаОкончания"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РезультатВыбораПериода", ЭтаФорма);
	
	ПараметрыДат = Новый Структура("НачалоПериода,КонецПериода",?(ЗначениеЗаполнено(Объект.ДатаНачалаПериода),Объект.ДатаНачалаПериода,НачалоДня(Объект.Дата)),?(ЗначениеЗаполнено(Объект.ДатаОкончанияПериода),Объект.ДатаОкончанияПериода,КонецДня(Объект.Дата)));
	
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода",ПараметрыДат,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатВыбораПериода(Результат, ДополнительныеПараметры) Экспорт

	Если Объект.Работы.Количество() > 0 Тогда
		ОчиститьТабличнуюЧасть(Результат, "ВыборПериода");
	ИначеЕсли Результат <> Неопределено Тогда
		Объект.ДатаНачалаПериода = Результат.НачалоПериода;
		Объект.ДатаОкончанияПериода = Результат.КонецПериода; 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодчиненныеСвойстваПоСтатистике(ИмяРеквизитаРодителя)
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьПодчиненныеСвойства(Объект, ИмяРеквизитаРодителя);
	
КонецПроцедуры

&НаСервере
Процедура ПодборРаботНаСервере(СписокРабот = Неопределено)
	
	Если СписокРабот <> Неопределено Тогда
		Если Объект.ВидОперации	=	Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСобственнымиСилами Тогда
			ЗаполнитьНаСервере(Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный, СписокРабот, Истина);
		ИначеЕсли Объект.ВидОперации	=	Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСиламиСубподрядчика Тогда
			ЗаполнитьПоСубподрядчикуНаСервере(СписокРабот, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьДлительностьНаСервере(ИдентификаторСтроки)
	
	ТекущиеДанные = Объект.Работы.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала)
		И ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
		
		
		ГрафикРаботы = Неопределено;
		Если ЗначениеЗаполнено(ТекущиеДанные.Работа) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УСОERP_СтроительныеРаботы.ГрафикРаботы
			|ИЗ
			|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
			|ГДЕ
			|	УСОERP_СтроительныеРаботы.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", ТекущиеДанные.Работа);
			результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ГрафикРаботы = Выборка.ГрафикРаботы;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ГрафикРаботы) Тогда
			ГрафикРаботы = Объект.ОбъектСтроительства.ГрафикРаботы;
		КонецЕсли;
		
		ТекущиеДанные.ДатаНачала = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПервоеРабочееВремяДня(ГрафикРаботы, ТекущиеДанные.ДатаНачала);
		ТекущиеДанные.ДатаОкончания = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПоследнееРабочееВремяДня(ГрафикРаботы, ТекущиеДанные.ДатаОкончания);
		
		СтруктураДлительности = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьДлительностьПериода(ГрафикРаботы, ТекущиеДанные.ДатаНачала, ТекущиеДанные.ДатаОкончания,);
		
		Если ТекущиеДанные.ЕдиницаДлительности = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда
			ТекущиеДанные.Длительность = СтруктураДлительности.ДлительностьЧас; 
		Иначе
			ТекущиеДанные.Длительность = СтруктураДлительности.ДлительностьДень;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьДатуОкончанияНаСервере(ИдентификаторСтроки)
	
	ТекущиеДанные = Объект.Работы.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если ЗначениеЗаполнено(ТекущиеДанные.Длительность)
		И ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала) Тогда
		
		ГрафикРаботы = Неопределено;
		Если ЗначениеЗаполнено(ТекущиеДанные.Работа) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УСОERP_СтроительныеРаботы.ГрафикРаботы
			|ИЗ
			|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
			|ГДЕ
			|	УСОERP_СтроительныеРаботы.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", ТекущиеДанные.Работа);
			результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ГрафикРаботы = Выборка.ГрафикРаботы;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ГрафикРаботы) Тогда
			ГрафикРаботы = Объект.ОбъектСтроительства.ГрафикРаботы;
		КонецЕсли;
		
		СтроительнаяРаботаСтруктура = Новый Структура;
		//СтроительнаяРаботаСтруктура.Вставить("Владелец", 		ТекущиеДанные.Владелец);
		СтроительнаяРаботаСтруктура.Вставить("ГрафикРаботы", 	ГрафикРаботы);
		СтроительнаяРаботаСтруктура.Вставить("Ссылка", 			ТекущиеДанные.Работа);
		
		ТекущиеДанные.ДатаОкончания	= УСОERP_УправлениеСтроительнымПроизводством.РассчитатьОкончаниеПериода(СтроительнаяРаботаСтруктура, 
		ТекущиеДанные.ДатаНачала, 
		ТекущиеДанные.Длительность, 
		ТекущиеДанные.ЕдиницаДлительности);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РаботаСБуферомОбмена

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказателиВыполненияРабот(Форма, ТекущаяСтрока = Неопределено)

	Если ТекущаяСтрока = Неопределено Тогда
		КоллекцияРаботы = Форма.Объект.Работы;
		Для каждого ЭлКоллекции Из КоллекцияРаботы Цикл
			ЭлКоллекции.ОбъемВыполнено = ЭлКоллекции.Объем + ЭлКоллекции.ОбъемНаНачалоПериода;
			ЭлКоллекции.ЭтоСуммарнаяРабота	=	УСОERP_УправлениеСтроительнымПроизводством.ЭтоСуммарнаяРабота(ЭлКоллекции.Работа);
		КонецЦикла;
	Иначе
		ТекущаяСтрока.ОбъемВыполнено		=	ТекущаяСтрока.Объем + ТекущаяСтрока.ОбъемНаНачалоПериода;
		ТекущаяСтрока.ЭтоСуммарнаяРабота	=	УСОERP_УправлениеСтроительнымПроизводством.ЭтоСуммарнаяРабота(ТекущаяСтрока.Работа);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДокументУтвержденияПриИзмененииНаСервере()
	НовыйВариант = Объект.ДокументУтверждения.СценарийПланирования.НовыйВариант = Истина;
	Объект.НаправлениеДеятельности = Объект.ДокументУтверждения.НаправлениеДеятельности;
	Объект.Работы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияПриИзменении(Элемент)
	ДокументУтвержденияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияОчистка(Элемент, СтандартнаяОбработка)
	ДокументУтвержденияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

#КонецОбласти
